//----------------------------------------------------------------------
// Москаленко Андрій 
// Група ІМ-42, КПІ, 2025
//----------------------------------------------------------------------

// Генератор випадкових чисел
// Видає значення в діапазоні [0, 1)
function xorshift32( seed ) {
  // JavaScript зберігає всі числа як 64-бітні числа з плаваючою комою, 
  // але побітові операції працюють з 32-бітними цілими.
  // приведення до беззнакового 32-бітного числа (uint32)
  let x = seed >>> 0; 

  //  << — лівий побітовий зсув
  // >>> — правий побітовий зсув без збереження знаку
  //   ^ — побітове виключне АБО (XOR)
  // повертає 1, якщо біти різні
  // повертає 0, якщо біти однакові
  return function () {
      x ^= x << 13;
      x ^= x >>> 17;
      x ^= x << 5;
      // нормалізація в діапазон [0, 1)
      return (x >>> 0) / 0xFFFFFFFF; 
  };
}

// Ітератор для перевірки якості генератора випадкових чисел
function testGenerator(generate, timeout, baskets) {
  // generate - генератор випадкових чисел
  // timeout - час на виконання
  // baskets - кількість кошиків у гістограммі
  const result = new Array(baskets).fill(0);
  const start = Date.now();
  let duration = 0;
  // 
  while (duration < timeout) {
    // Обробляємо 1000 значень
    for (let i = 0; i < 1000; i++) {
      const basketIndex =  Math.ceil(generate() * baskets) - 1;
      result[basketIndex]++;
    }
    duration = (Date.now() - start) / 1000;
  }
  // Готова гістограма
  return result;
}


// EXPORT
//----------------------------------------------------------------------
module.exports = { xorshift32, testGenerator };


// THE END
//----------------------------------------------------------------------